ErichStyger/mcuoneclipse/Examples/MCUXpresso/tinyK22/tinyK22_HanoverFlipDot/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */
#define SOPT5_UART1TXSRC_UART_TX 0x00u /*!<@brief UART 1 transmit data source select: UART1_TX pin */

/*! @name PORTC2 (number 45), LED_BLUE
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_BLUE_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_BLUE_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED_BLUE_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_BLUE_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_BLUE_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTD0 (number 57), LANE0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LANE0_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LANE0_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LANE0_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LANE0_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LANE0_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTD1 (number 58), LANE1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LANE1_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LANE1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LANE1_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LANE1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LANE1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTD2 (number 59), LANEq
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LANE2_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LANE2_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LANE2_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LANE2_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LANE2_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTD3 (number 60), LANE3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LANE3_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LANE3_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LANE3_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LANE3_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LANE3_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTD4 (number 61), LANE4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LANE4_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LANE4_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LANE4_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LANE4_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LANE4_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC4 (number 49), LPUART_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LPUART_TX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LPUART_TX_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LPUART_TX_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTC3 (number 46), LPUART_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LPUART_RX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LPUART_RX_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LPUART_RX_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTB17 (number 40), RS485_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RS485_TX_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RS485_TX_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RS485_TX_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTB16 (number 39), RS485_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RS485_RX_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RS485_RX_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RS485_RX_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTB2 (number 37), RS458_RTS
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RS458_RTS_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RS458_RTS_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RS458_RTS_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTD7 (number 64), BLE_MISO
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_BLE_MISO_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BLE_MISO_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BLE_MISO_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTD6 (number 63), BLE_MOSI
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_BLE_MOSI_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BLE_MOSI_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BLE_MOSI_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTD5 (number 62), BLE_CLK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_BLE_CLK_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BLE_CLK_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BLE_CLK_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTC11 (number 56), BLE_CS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BLE_CS_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BLE_CS_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_BLE_CS_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BLE_CS_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BLE_CS_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTC10 (number 55), BLE_IRQ
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BLE_IRQ_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BLE_IRQ_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_BLE_IRQ_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BLE_IRQ_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BLE_IRQ_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
